USE School;

declare @schoolName nvarchar(32)
set @schoolName = 'NVK666';

EXEC('
INSERT INTO ' + @schoolName + 'Cabinet
	(CabinetNumber, IdAppointment)
values
	(101, 1),
	(102, 2),
	(103, 3),
	(104, 4),
	(105, 5),
	(106, 6),
	(107, 7),
	(108, 8)
');

EXEC('
INSERT INTO ' + @schoolName + 'Class
	(NameClass, IdCabinet)
values
	(N''11-А'', 3),
	(N''11-Б'', 2)
');

EXEC('
INSERT INTO ' + @schoolName + 'Adress
	(City, Street, HouseNum, Enterance, FlatNum)
values
	(N''Рівне'', 	N''Струтинська'', 		1, 	1, 51),
	(N''Рівне'', 	N''Буковинська'', 		5, 	2, 25),
	(N''Рівне'', 	N''Орлова'', 			7, 	3, 75),
	(N''Рівне'', 	N''Орлова'',			9, 	4, 23),
	(N''Рівне'',	N''Орлова'', 			2, 	5, 34),
	(N''Рівне'',	N''Київська'', 			6, 	1, 35),
	(N''Рівне'',	N''Київська'', 			12, 5, 23),
	(N''Рівне'',	N''Хмельницького'',		8, 	6, 67),
	(N''Рівне'',	N''Сагайдачного'', 		9, 	4, 23),
	(N''Рівне'', 	N''Садовського'',		3, 	2, 10),
	(N''Рівне'', 	N''Садибна'', 			6, 	4, 12),
	(N''Рівне'', 	N''Струтинська'', 		9, 	1, 17),
	(N''Рівне'', 	N''Саксаганського'',	14, 2, 15),
	(N''Рівне'',	N''Сальського'', 		13, 5, 4),
	(N''Рівне'', 	N''Самойлюка'', 		8, 	1, 77),
	(N''Рівне'',	N''Самокиша'', 			5, 	4, 12),
	(N''Рівне'',	N''Свєшнікова'', 		6, 	7, 15),
	(N''Рівне'',	N''Свободи'', 			2, 	5, 18),
	(N''Рівне'',	N''Світанкова'', 		7, 	3, 22),
	(N''Рівне'', 	N''Серпанкова'', 		8, 	2, 75),
	(N''Рівне'', 	N''Севастопольська'', 	8, 	1, 16),
	(N''Рівне'', 	N''Скоропадського'', 	2,	4, 22),
	(N''Рівне'', 	N''Симиренка'', 		4, 	3, 36),
	(N''Рівне'', 	N''Скляренка'', 		7, 	2, 45),
	(N''Рівне'', 	N''Скрипника'', 		9, 	5, 65),
	(N''Городище'', N''Слави'', 			4, 	6, 86),
	(N''Городище'', N''Слави'', 			6, 	2, 27),
	(N''Городище'', N''Слави'', 			8, 	3, 38),
	(N''Городище'', N''Соборна'', 			9, 	4, 59),
	(N''Городище'', N''Соборна'', 			2, 	1, 60),
	(N''Рівне'', 	N''Скрипника'', 		9, 	5, 65),
	(N''Рівне'', 	N''Садовського'', 		4, 	6, 86),
	(N''Рівне'', 	N''Симиренка'', 		6, 	2, 27),
	(N''Рівне'', 	N''Свободи'', 			8, 	3, 38),
	(N''Рівне'', 	N''Соборна'', 			9, 	4, 59)
');

EXEC('
INSERT INTO ' + @schoolName + 'Parents
	(FirstName, SecondName, ThirdName, IdAdress)
values
	(N''Анна'', 	N''АЛЕКСАНДР'',			N''Гнатівна'', 1 	),
	(N''Михайло'', 	N''АЛЕКСАНДР'',			N''Іванович'', 1 	),
	
	(N''Аліна'', 		N''КУЧЕР'',					N''Готлібовна'', 2 ),
	(N''Корній'', 		N''КУЧЕР'',					N''Карлович'', 2 ),
	
	(N''Валерія'', 		N''Максимчук'',				N''Кирилівна'', 3 	),
	(N''Павло'', 		N''Максимчук'',				N''Фрідріхович'', 3 	),
	
	(N''Кароліна'', 	N''Калиновська'',			N''Трохимівна'', 4 ),
	(N''Андрій'', 	N''Калиновська'',			N''Полікарпович'', 4 ),
	
	(N''Катерина'', 	N''Соражке'',			N''Іванівна'', 5 	),
	(N''Семен'', 	N''Соражке'',			N''Евстафійович'', 5 	),
	
	(N''Поліна'', N''Шаправський'',			N''Михайлівна'', 6		),
	(N''Іван'', N''Шаправський'',			N''Іванович'', 6 		),
	
	(N''Ірина'', 		N''Крепський'',				N''Василівна'', 7),
	(N''Іпполіт'', 		N''Крепський'',				N''Митрофанович'', 7),
	
	(N''Аріна'', 	N''Березнюк'',				N''Генріховна'', 8 	),
	(N''Іван'', 	N''Березнюк'',				N''Августович'', 8 	),
	
	(N''Марія'', 	N''Богатко'',				N''Михайлівна'', 9 	),
	(N''Степан'', 	N''Богатко'',				N''Альбертович'', 9 	),
	
	(N''Тетяна'', 	N''Парчевський'',			N''Владиславівна'', 10 		),
	(N''Павло'', 	N''Парчевський'',			N''Вільгельмович'', 10		),
	
	(N''Крістіна'', 	N''Годун'',					N''Іванівна'', 11 	),
	(N''Корній'', 	N''Годун'',					N''Вітольдович'', 11 	),
	
	(N''Єва'', N''Дембицький-Піоро'',	N''Іванівна'', 12 ),
	(N''Олександр'', N''Дембицький-Піоро'',	N''Васильович'', 12 ),
	
	(N''Олександра'', 	N''Цудзик'',				N''Микитівна'', 13 		),
	(N''Іван'', 	N''Цудзик'',				N''Антонович'', 13 		),
	
	(N''Яна'', 	N''Яковлєв'',				N''Федорівна'', 14 		),
	(N''Іван'', 	N''Яковлєв'',				N''Фрідріхович'', 14 		),
	
	(N''Ольга'', 	N''Томашевський'',			N''Василівна'', 15 	),
	(N''Віктор'', 	N''Томашевський'',			N''Митрофанович'', 15 	),
	
	(N''Юлія'', N''Соловей'',				N''Ивановна'', 16 		),
	(N''Іван'', N''Соловей'',				N''Августович'', 16 		),
	
	(N''Софія'', N''Шпилька'',				N''Захаровівна'', 17		),
	(N''Юліан'', N''Шпилька'',				N''Захарович'', 17		),
	
	(N''Вікторія'', 	N''Гордіюк'',				N''Адамівна'', 18 	),
	(N''Генріх'', 	N''Гордіюк'',				N''Іванович'', 18 	),
	
	(N''Єлизавета'', 	N''Дзевицький'',			N''Павлівна'', 19 	),
	(N''Віктор'', 	N''Дзевицький'',			N''Ілліч'', 19 	),
	
	(N''Ангеліна'', 	N''Івеновський'',			N''Іванівна'', 20 	),
	(N''Йосип'', 	N''Івеновський'',			N''Пилипович'', 20 	)
');

EXEC('
INSERT INTO ' + @schoolName + 'Pupil
	(IdClass, FirstName, SecondName, ThirdName, Sex, DateОfBirth, IdAdress, IdParentsMother, IdParentsFather)
VALUES
	(1, N''Сергій'', 	N''АЛЕКСАНДРОВИЧ'',			N''Михайлович'', 	1, ''2002-01-1'', 1, 1, 2), 	--1
	(1, N''Іван'', 		N''КУЧЕР'',					N''Корнійович'', 	1, ''2001-12-7'', 2, 3, 4),
	(1, N''Іван'', 		N''Максимчук'',				N''Павлович'', 		1, ''2002-05-15'', 3, 5, 6),
	(1, N''Кароліна'', 	N''Калиновська'',			N''Андріївна'', 	0, ''2001-07-21'', 4, 7, 8),
	(1, N''Антон'', 	N''Соражкевич'',			N''Семенович'', 	1, ''2002-02-24'', 5, 9, 10),
	(1, N''Володимир'', N''Шаправський'',			N''Іванович'', 		1, ''2001-05-7'', 6, 11, 12),
	(1, N''Іван'', 		N''Крепський'',				N''Іпполітович'', 	1, ''2001-03-9'', 7, 13, 14),
	(1, N''Всеволод'', 	N''Березнюк'',				N''Іванович'', 		1, ''2001-02-21'', 8, 15, 16),
	(1, N''Никифор'', 	N''Богатко'',				N''Степанович'', 	1, ''2002-08-17'', 9, 17, 18),
	(1, N''Михайло'', 	N''Парчевський'',			N''Павлович'', 		1, ''2001-11-25'', 10, 19, 20),	--10
	(2, N''Радіон'', 	N''Годун'',					N''Корнієвич'', 	1, ''2002-10-15'', 11, 21, 22),
	(2, N''Фелікс-Адам'', N''Дембицька-Піоро'',	N''Олександрвна'', 		0, ''2001-01-19'', 12, 23, 24),
	(2, N''Генріх'', 	N''Цудзик'',				N''Іванович'', 		1, ''2001-04-12'', 13, 25, 26),
	(2, N''Казимир'', 	N''Яковлєв'',				N''Іванович'', 		1, ''2001-02-25'', 14, 27, 28),
	(2, N''Євгеній'', 	N''Томашевський'',			N''Вікторович'', 	1, ''2001-12-25'', 15, 29, 30),
	(2, N''Станіслав'', N''Соловей'',				N''Іванович'', 		1, ''2002-06-28'', 16, 31, 32),
	(2, N''Володимир'', N''Шпилька'',				N''Юлянович'', 		1, ''2002-08-6'', 17, 33, 34),
	(2, N''Йосип'', 	N''Гордіюк'',				N''Генріхович'', 	1, ''2002-01-2'', 18, 35, 36),
	(2, N''Павло'', 	N''Дзевицький'',			N''Вікторович'', 	1, ''2002-10-6'', 19, 37, 38),
	(2, N''Тихон'', 	N''Івеновський'',			N''Йосипович'', 	2, ''2002-05-22'', 20, 39, 40)	--20
');

EXEC('
INSERT INTO ' + @schoolName + 'PassedMedicalPaper
	(IdMedicalPaper, IdPupil)
values
	(1, 1),
	(1, 2),
	(1, 3),
	(1, 5),
	(1, 6),
	(1, 7),
	(1, 9),
	(1, 11),
	(1, 12),
	(1, 13),
	(1, 14),
	(1, 15),
	(1, 16),
	(1, 17),
	(1, 18)
');

EXEC('
INSERT INTO ' + @schoolName + 'Staff
	(FirstName, SecondName, ThirdName, Salary, IdRole, Sex, DateОfBirth, IdAdress)
VALUES
	(N''Ксенія'', 	N''КОВАЛЬ'',		N''Федорівна'', 	3600, 1, 0, ''1980-01-1'', 21),
	(N''Онисія'', 	N''БАРИЛО'',		N''Йосифівна'', 	3600, 2, 0, ''1982-05-5'', 22),
	(N''Елька'', 	N''БРАТУНЬ'',		N''Федорівна'', 	3600, 3, 0, ''1984-07-2'', 23),
	(N''Мигут'', 	N''ШВАЙКО'',		N''Марківна'', 	3600, 4, 0, ''1985-09-9'', 24),
	(N''Марія'', 	N''КОРОЛЬ'',		N''Григорівна'', 	3600, 5, 0, ''1983-02-12'', 25),
	(N''Анастасія'', 	N''ДЯДИК'',		N''Антонівна'', 	3600, 6, 0, ''1988-05-16'', 26),
	(N''Ольга'', 	N''БОРУКАЙЛО'',		N''Костянтинівна'', 	3600, 7, 0, ''1989-07-18'', 27),
	(N''Василина'', 	N''ЯРЕМЕНКО'',	N''Григорівна'', 	3600, 8, 0, ''1980-11-8'', 28),
	(N''Магдалена'', 	N''СТЕЦЬ'',		N''Іванівна'', 	3600, 9, 0, ''1982-10-6'', 29),
	(N''Катерина'', 	N''ЛЯТОШ'',		N''Войцехівна'', 	3600, 10, 0, ''1984-05-19'', 30),
	(N''Петро'', 	N''РАПОПОРТ'',		N''Йосифович'', 	3600, 11, 1, ''1986-07-21'', 31),
	(N''Лев'', 	N''КОГУТ'',				N''Олексійович'', 	3600, 12, 1, ''1982-03-26'', 32),
	(N''Максим'', 	N''ГЕРСТЕНГАЙМ'',	N''Михайлович'', 	3600, 13, 1, ''1986-10-19'', 33),
	(N''Сергій'', 	N''ЛЕВИЦЬКИЙ'',		N''Семенович'', 	3600, 14, 1, ''1987-08-1'', 34),
	(N''Вацлав'', 	N''БАРИНЮК'',		N''Теодорович'', 	3600, 15, 1, ''1988-12-21'', 35)	
');

EXEC('
INSERT INTO ' + @schoolName + 'CabinetKeeper
	(IdStaff, IdCabinet)
values
	(6, 1),
	(7, 2),
	(8, 3),
	(9, 4),
	(10, 5),
	(11, 6),
	(12, 7),
	(13, 8)
');

EXEC('
INSERT INTO ' + @schoolName + 'ClassMaster
	(IdStaff, IdClass)
values
	(13, 1),
	(14, 2)
');

EXEC('
INSERT INTO ' + @schoolName + 'Teacher
	(IdStaff)
values
	(6),
	(7),
	(8),
	(9),
	(10),
	(11),
	(12),
	(13),
	(14),
	(15)
');

EXEC('
INSERT INTO ' + @schoolName + 'SubjectTeacher
	(IdTeacher, IdSubject)
values
	(1, 1),
	(2, 2),
	(3, 3),
	(4, 4),
	(5, 5),
	(6, 6),
	(7, 7),
	(8, 8),
	(9, 9),
	(10, 10)
');

EXEC('
INSERT INTO ' + @schoolName + 'Timetable
	(StartTime, EndTime, IdSubject, IdCabinet, IdClass, IdTeacher)
values
	(''08:00:00'', ''08:45:00'', 1, 1, 1, 1),
	(''08:00:00'', ''08:45:00'', 2, 2, 2, 2),
	
	(''08:50:00'', ''09:30:00'', 2, 3, 1, 2),
	(''08:50:00'', ''09:30:00'', 1, 4, 2, 1),
	
	(''09:45:00'', ''10:30:00'', 3, 5, 1, 3),
	(''09:45:00'', ''10:30:00'', 4, 6, 2, 4),
	
	(''10:45:00'', ''11:30:00'', 4, 1, 1, 4),
	(''10:45:00'', ''11:30:00'', 3, 2, 2, 3),
	
	(''11:45:00'', ''12:30:00'', 5, 3, 1, 5),
	(''11:45:00'', ''12:30:00'', 6, 4, 2, 6),
	
	(''12:45:00'', ''13:30:00'', 6, 3, 1, 6),
	(''12:45:00'', ''13:30:00'', 5, 4, 2, 5),
	
	(''13:45:00'', ''14:30:00'', 10, 8, 1, 7),
	(''13:45:00'', ''14:30:00'', 10, 8, 2, 8)
');

EXEC('
INSERT INTO ' + @schoolName + 'Mark
	(Number, IdPupil, IdTeacher, IdSubject, Date)
values
	(5, 1, 1, 1, ''2018-10-01''),
	(12, 11, 2, 2, ''2018-10-01''),
	(9, 2, 2, 2, ''2018-10-01''),
	(10, 12, 1, 1, ''2018-10-01''),
	(9, 3, 3, 3, ''2018-10-01''),
	(10, 13, 4, 4, ''2018-10-01''),
	(9, 4, 4, 4, ''2018-10-01''),
	(10, 14, 3, 3, ''2018-10-01''),
	(12, 5, 5, 5, ''2018-10-01''),
	(10, 15, 6, 6, ''2018-10-01''),
	(10, 6, 6, 6, ''2018-10-01''),
	(10, 16, 5, 5, ''2018-10-01''),
	(6, 1, 7, 10, ''2018-10-01''),
	(9, 11, 8, 10, ''2018-10-01'')
');