USE HotelDB;

INSERT INTO Position 
(PositionName, Salary, Duties, Requirements)
VALUES
(N'Повар', 3300, N'Готувати їжу на кучу осіб', N'2 руки, відсутність клептоманії'),
(N'Бариста', 3300, N'Готувати напої', N'Ефектно готувати напої'),
(N'Уборщик', 3300, N'Прибирати всю територію готелю', N'Акуратність, активність, амбіційністья'),
(N'Шофер', 3300, N'Їздити на вимогу повара/баристи/прибиральника/клієнта', N'вміння працювати в команді, вміння переконувати'),
(N'Менеджер', 6666, N'Робити все, що не роблять попередні 4', N'працьовитість, самостійність')

INSERT INTO Service 
(ServiceName, Description, Price)
VALUES
(N'Сніданок', null, 50),
(N'Обід', null, 50),
(N'Вечеря', null, 50),
(N'Басейн', N'На 1 день', 100),
(N'Баня', N'На 1 годину.', 250)

INSERT INTO Worker 
(FirstName, Lastname, FatherName, BitrhDate, IsMan, Adress, Phone, IdPasport, IdPosition)
VALUES
(N'Михаил', N'Бухало', N'Никонович',		'1980-07-01',  		1, null, N'70184572', N'37614645', 3),
(N'Светлана', N'Пьяныха', N'Филиповна',		'1982-10-20', 		0, null, N'66005722', N'25324078', 3),
(N'Наталья', N'Давыдова', N'Федотовна',		'1986-06-03', 		0, null, N'73253780', N'23024789', 3),
(N'Виктор', N'Лихачев', N'Толиевич',		'1984-10-21', 		1, null, N'97405273', N'75787934', 3),
(N'Владлен', N'Гуськов', N'Сенович',		'1988-04-11', 		1, null, N'20321248', N'10404712', 3),
(N'Екатерина', N'Косма', N'Ефимовна',		'1991-01-02',  		0, null, N'33223757', N'73846675', 3),
(N'Тихон', N'Умберг', N'Прохович',			'1992-08-20', 		1, null, N'72258194', N'57315692', 1),
(N'Захар', N'Сенькин', N'Иракевич',			'1994-04-20', 		1, null, N'76965953', N'81483097', 2),
(N'Тимофей', N'Мизенов', N'Ментович',		'1994-11-16', 		1, null, N'36816431', N'67103364', 4),
(N'Адам', N'Кабинов', N'Измалович',			'1998-08-22', 		1, null, N'36696026', N'37038372', 5)  
   

INSERT INTO Room 
(RoomName, HumanCnt, Description, Price, IdWorker)
VALUES
(N'№1408', 3, N'Та сама', 1500, 1),
(N'№13', 2, null, 250, 2),
(N'№666', 3, null, 200, 3),
(N'Мансандра', 1, null, 150, 4),
(N'Підвал', 1, N'Бюджетний варіант', 100, 5)

INSERT INTO Client 
(FirstName, Lastname, FatherName, InDate, OutDate, IdRoom, IdService1, IdService2, IdService3, Price, IdWorker)
VALUES
(N'Зинаида', N'Грекова', N'Антовна',	'2018-01-04', '2018-01-17',  		1, 1, 2, 3, 1085, 1),
(N'Полина', N'Куданова', N'Еменовна',	'2018-01-24', '2018-02-28', 		2, 1, 2, 3, 7594, 2),
(N'Аким', N'Чернодин', N'Леонивна',		'2018-03-06', '2018-04-16', 		3, 1, 5, 3, 6129, 3),
(N'Любава', N'Салнова', N'Дадович',		'2018-04-29', '2018-05-08', 		3, 1, 5, 3, 4032, 4),
(N'Сократ', N'Богозов', N'Сенович',		'2018-05-15', '2018-05-17', 		5, 1, 4, 3, 3019, 5),
(N'Марианна', N'Унтилова', N'Нилаевна',	'2018-05-19', '2018-06-03', 		1, 1, 4, 3, 7704, 6),
(N'Игорь', N'Эмский', N'Михеевич',		'2018-06-06', '2018-06-07', 		4, 1, 4, 3, 522,  1),
(N'Иосиф', N'Поджио', N'Прович',		'2018-06-12', '2018-06-22', 		5, 1, 2, 3, 3603, 2),
(N'Елисей', N'Буклин', N'Юриевич',		'2018-07-21', '2018-08-07', 		3, 1, 5, 3, 3101, 3),
(N'Дарья', N'Крукова', N'Вседовна',		'2018-08-11', '2018-08-28', 		2, 1, 2, 3, 8677, 4) 