/*
Ігор та банани
Ігор хоче купити w бананів в магазині. Йому потрібно заплатити k доларів за перший банан, 2k доларів - за другий і так далі
(іншими словами, за i-й банан треба заплатити i * k доларів). У нього є n доларів. 
Яку суму доларів йому доведеться позичити у товариша, щоб купити w бананів?

Формат входных данных
У першому рядку записано три додатних цілих числа k, n, w (1 ≤ k, w ≤ 1 000, 0 ≤ n ≤ 109), 
відповідно ціна першого банана, початкова сума доларів у Ігоря та кількість бананів, яку він хоче купити.

Формат результата
Виведіть єдине ціле число - скільки доларів Ігору потрібно позичити у товариша. Якщо гроші позичати не треба, виведіть 0.
*/

#include <iostream>
using namespace std;

int main() {
	int k, n, w, sum = 0;

	cin >> k >> n >> w;

	while (w != 0) {
		sum += k * w;
		--w;
	}

	if (sum <= n)
		cout << 0;
	else
		cout << sum - n;

	return 0;
}