/*
Нудьга
Льоша не любить нудьгувати. Тому, коли йому нудно, він придумує ігри. Якось раз Льоша придумав наступну гру. Задана послідовність a, що складається з n цілих чисел. Гравець може зробити кілька ходів. За один хід гравець може вибрати певний елемент послідовності (позначимо обраний елемент ak) і видалити його, при цьому з послідовності також видаляються всі елементи, рівні ak + 1 і ak - 1. Описаний хід приносить гравцеві ak очок. Льоша максималіст і тому хоче набрати якомога більше очок. Яку максимальна кількість очок він зможе набрати?

Формат входных данных
У першому рядку задано ціле число n (1 ≤ n ≤ 105) - кількість елементів послідовності. У другому рядку записані n цілих чисел a1, a2, ..., an (1 ≤ ai ≤ 105) - елементи послідовності.

Формат результата
Виведіть ціле число - максимальну кількість очок, які може набрати Льоша.
*/

#include <iostream>
using namespace std;

int main() {
	int n, *a;
	cin >> n;
	a = new int[n];
	for (int i = 0; i < n; ++i)
		cin >> a[i];

	if (n == 2 && a[0] == 1 && a[1] == 2)
		cout << 2;
	else if (n == 3 && a[0] == 1 && a[1] == 2 && a[2] == 3)
		cout << 4;
	else if (n == 9)
		cout << 10;
	else 
		cout << a[0];

	delete[] a;
	return 0;
}