/*
Куплю лопату
Олександру терміново знадобилася лопата! Він прийшов у магазин і вибрав підходящу. Лопата, яка підійшла Олександру, продається за ціною k гривень. Вважайте, що в магазині необмежена кількість таких лопат.
У кишені в Олександра є необмежена кількість «червонців» (купюр номіналом в 10 гривень) і рівно одна купюра номіналу r (1 ≤ r ≤ 9).
Яку найменшу кількість лопат доведеться придбати Олександрові, щоб він зміг розрахуватись за покупку без здачі? Очевидно, що за 10 лопат він зможе розрахуватись без здачі (заплативши необхідну суму «червонцями», не використовуючи купюру номіналу r), але, можливо, він зможе придбати меншу кількість лопат і розрахуватись без здачі. Зверніть увагу, що Олександр повинен придбати хоча б одну лопату.

Формат входных данных
У єдиному рядку вхідних даних записані два цілих числа k і r (1 ≤ k ≤ 1000, 1 ≤ r ≤ 9) - ціна однієї лопати і номінал купюри в кишені Олександра (відмінна від «червонця»).
Пам'ятайте, що ще у нього в кишені необмежена кількість купюр номіналу 10, тобто їх вистачить на покупку будь-якої кількості лопат.

Формат результата
Виведіть шукану мінімальну кількість лопат, які потрібно придбати Олександру, щоб розрахуватись без здачі.
*/

#include <iostream>
using namespace std;

int main() {
	int k, r, kc = 1, p;
	cin >> k >> r;
	
	while (true) {
		p = k * kc;
		if (p % 10 == 0 || (p - r) % 10 == 0)
			break;
		++kc;
	}

	cout << kc;

	return 0;
}