/*
Свято рівності
У Рівляндії настало свято рівності. На честь свята король вирішив за рахунок державної скарбниці зрівняти добробут всіх громадян Рівляндії.
Всього в Рівляндії n громадян, добробут кожного з яких визначається цілим числом в ai вигрень (вигрень - грошова одиниця Рівляндії).
Ви - королівський скарбник, якому потрібно порахувати мінімальні витрати королівства на подарунок короля. Король може тільки давати гроші, а відбирати їх він не має права.

Формат входных данных
У першому рядку вхідних даних міститься ціле число n (1 ≤ n ≤ 100) - кількість громадян Королівства.
У другому рядку містяться n чисел a1, a2, ..., an, де ai (0 ≤ ai ≤ 106) - добробут i-го громадянина.

Формат результата
У єдиний рядок вихідних даних виведіть ціле число S - мінімальна кількість вигрень, який доведеться витратити.
*/

#include <iostream>
using namespace std;

int main() {
	long long n, a[200], max = -1, sum = 0;
	cin >> n;
	for (char i = 0; i < n; ++i) {
		cin >> a[i];
		if (a[i] > max)
			max = a[i];
	}

	for (char i = 0; i < n; ++i)
		sum += max - a[i];

	cout << sum;
	return 0;
}