/*
Антон і цифри
Нещодавно Антон знайшов у себе вдома коробку з цифрами. У коробці було k2 цифр 2, k3 цифр 3, k5 цифр 5 і k6 цифр 6.
Улюблені числа Антона - 32 і 256. Тому він, вирішив скласти з цифр, які перебували в коробці, свої улюблені числа. При цьому він хоче, щоб сума складених чисел була якомога більше. Допоможіть Антону знайти цю суму!
Кожну цифру можна використовувати не більше одного разу, тобто в складених Антоном чисел має бути не більше k2 цифр 2, k3 цифр 3 і так далі. Невикористані цифри в сумі не враховуються.

Формат входных данных
У єдиному рядку вхідних даних знаходяться чотири цілих числа k2, k3, k5, k6 - кількість цифр 2, 3, 5 і 6 відповідно (0 ≤ k2, k3, k5, k6 ≤ 5 * 106).

Формат результата
У єдиному рядку вихідних даних виведіть єдине число - максимальну суму улюблених чисел Антона, які можна скласти за допомогою цифр з коробки.
*/

#include <iostream>
using namespace std;

int main() {
	long long k2, k3, k5, k6, sum = 0;
	cin >> k2 >> k3 >> k5 >> k6;

	while (true) {
		if (k2 != 0 && k5 != 0 && k6 != 0) {
			--k2;
			--k5;
			--k6;
			sum += 256;
		}
		else if (k2 != 0 && k3 != 0) {
			--k2;
			--k3;
			sum += 32;
		}
		else
			break;
	}

	cout << sum;

	return 0;
}