/*
Гра
Два гравці грають в просту гру. У кожного гравця є коробка з кулями, причому коробка першого гравця містить рівно n1 куль, а коробка другого гравця містить рівно n2 куль. За один хід перший гравець може взяти від 1 до k1 куль зі своєї коробки і викинути їх. Аналогічним чином, за один хід другий гравець може взяти від 1 до k2 куль зі своєї коробки і викинути їх. Гравці ходять по черзі і перший гравець починає гру. Програє той, хто не може зробити хід. Ваше завдання визначити, хто виграє гру, якщо обидва гравці роблять ходи оптимальним чином.

Формат входных данных
Єдиний рядок вхідних даних містить чотири цілих числа n1, n2, k1, k2. Всі числа у вхідних даних не менше 1 і не більше 50.

Формат результата
Виведіть "First" якщо виграє перший гравець і "Second" в іншому випадку.
*/

#include <iostream>
using namespace std;

int main() {
	long long n1, n2, k1, k2;
	cin >> n1 >> n2 >> k1 >> k2;
	

	if (n1 == n2)
		cout << "Second";
	else if (n1 > n2)
		cout << "First";
	else
		cout << "Second";

	return 0;
}