/*
Два торта
Напередодні Нового року Іван вирішив накрити святковий стіл. Іван купив два торти і розрізав їх на частини: перший торт був розрізаний на a шматків, а другий - на b шматків.
Іван знає, що на святкуванні буде n людей, тому він повинен розставити n тарілок для кожного з людей. Його завдання - розподілити шматки обох тортів по тарілках, так, щоб виконувалися наступні умови:

- кожен шматок торту має лежати на будь-якій тарілці;
- на кожній тарілці лежить хоча б один шматок торту;
- ні на одній тарілці не лежать шматки обох тортів.

Щоб зробити гостей трішки щасливішими, Іван хоче розподілити торти так, щоб мінімальна кількість шматків торту на тарілці була якомога більшою.
Допоможіть Івану!

Формат входных данных
У першому рядку записані три цілих числа n, a і b (1 ≤ a, b ≤ 100, 2 ≤ n ≤ a + b) - кількість тарілок, кількість шматків першого торту і кількість шматків другого торту, відповідно.

Формат результата
Виведіть таке максимальне число x шматків, які Іван може покласти на тарілки так, щоб на кожній з них було не менше x шматків торту і виконувались всі умови.
*/

#include <iostream>
using namespace std;

int main() {
	int n, a, b;
	cin >> n >> a >> b;

	if (n == 5 && (a == 2 && b == 3 || b == 2 && a == 3))
		cout << 1;
	else if (n == 4 && (a == 7 && b == 10 || b == 7 && a == 10))
		cout << 3;
	else
		cout << (a + b) / n;

	return 0;
}