/*
Книги
Коли у Валери з'являється вільний час, він йде в бібліотеку і читає книги. Ось і сьогодні у нього з'явилося t вільних хвилин для читання. Тому Валера взяв n книг у бібліотеці і для кожної книги визначив який час буде потрібно, щоб її прочитати. Пронумеруємо книги цілими числами від 1 до n. Для прочитання i-тої книги Валері потрібно ai хвилин.
Валера вирішив, що він вибере довільну книгу з номером i та буде читати книги одну за одною, починаючи з цієї книги. Іншими словами, з початку він прочитає книгу з номером i, потім книгу з номером i + 1, потім книгу з номером i + 2 і т. д. Він продовжує цей процес до тих пір, поки не закінчиться його вільний час або не прочитає книгу з номером n. Кожну книгу Валера читає повністю, тобто він не починає читати наступну книгу, поки не не прочитає поточну книгу до кінця.
Визначте яку максимальну кількість книг Валера зможе прочитати.

Формат входных данных
У першому рядку задано два цілих числа n і t (1 ≤ n ≤ 105; 1 ≤ t ≤ 109) - кількість книг і кількість вільних хвилин у Валери відповідно. У другому рядку задана послідовність з n цілих чисел a1, a2, ..., an (1 ≤ ai ≤ 104), в якій число ai відповідає кількості хвилин, що потрібно для прочитання i-тої книги.

Формат результата
Виведіть єдине ціле число - максимальну кількість книг, які Валера зможе прочитати.
*/

#include <iostream>
using namespace std;

int main() {
	int n, t, b, *a, s = 0, bMax = -100, tl, i = 0;
	cin >> n >> t;
	a = new int[n];
	for (; i < n; ++i)
		cin >> a[i];

	while (s != n) {
		for (i = s, b = 0, tl = t; i < n && tl >= a[i]; ++i) {
			++b;
			tl -= a[i];
		}

		if (b > bMax)
			bMax = b;
		++s;
	}


	cout << bMax;
	return 0;
}